Revit 2026 API

# IFCProductWrapperAddElement Method

---

Adds an IfcElement handle to associate with the IfcProduct in this wrapper.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddElement(
	IFCAnyHandle elementHandle,
	IFCLevelInfo pLevelInfo,
	IFCExtrusionCreationData params,
	bool relateToLevel
)
```
```vb
Public Sub AddElement (
	elementHandle As IFCAnyHandle,
	pLevelInfo As IFCLevelInfo,
	params As IFCExtrusionCreationData,
	relateToLevel As Boolean
)
```
```cpp
public:
void AddElement(
	IFCAnyHandle^ elementHandle,
	IFCLevelInfo^ pLevelInfo,
	IFCExtrusionCreationData^ params,
	bool relateToLevel
)
```
```fsharp
member AddElement :
        elementHandle : IFCAnyHandle *
        pLevelInfo : IFCLevelInfo *
        params : IFCExtrusionCreationData *
        relateToLevel : bool -> unit
```

#### Parameters

elementHandle IFCAnyHandle
     The IfcElement handle.
pLevelInfo IFCLevelInfo
     The level info.
params IFCExtrusionCreationData
     The extrusion creation data associated with the given element. Optional, can be .
relateToLevel Boolean
     True to relate the element to the level, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.

#### Reference

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace